r0ket/r0ket/firmware/core/lpc134x.h
/*  System Control Register */

#define SCB_SCR                                   (*(pREG32 (0xE000ED10)))
#define SCB_SCR_SLEEPONEXIT_MASK                  ((unsigned int) 0x00000002) // Enable sleep on exit
#define SCB_SCR_SLEEPONEXIT                       ((unsigned int) 0x00000002)
#define SCB_SCR_SLEEPDEEP_MASK                    ((unsigned int) 0x00000004)
#define SCB_SCR_SLEEPDEEP                         ((unsigned int) 0x00000004) // Enable deep sleep
#define SCB_SCR_SEVONPEND_MASK                    ((unsigned int) 0x00000010) // Wake up from WFE is new int is pended regardless of priority
#define SCB_SCR_SEVONPEND                         ((unsigned int) 0x00000010)

/*  Application Interrupt and Reset Control Register */

#define SCB_AIRCR                                 (*(pREG32 (0xE000ED0C)))
#define SCB_AIRCR_VECTKEY_VALUE                   ((unsigned int) 0x05FA0000) // Vect key needs to be set to 05FA for reset to work
#define SCB_AIRCR_VECTKEY_MASK                    ((unsigned int) 0xFFFF0000)
#define SCB_AIRCR_ENDIANESS                       ((unsigned int) 0x00008000) // Read Endianness (1=Big, 0=Little)
#define SCB_AIRCR_ENDIANESS_MASK                  ((unsigned int) 0x00008000)
#define SCB_AIRCR_PRIGROUP                        ((unsigned int) 0x00000700)
#define SCB_AIRCR_PRIGROUP_MASK                   ((unsigned int) 0x00000700)
#define SCB_AIRCR_SYSRESETREQ                     ((unsigned int) 0x00000004) // Request system reset
#define SCB_AIRCR_SYSRESETREQ_MASK                ((unsigned int) 0x00000004)
#define SCB_AIRCR_VECTCLRACTIVE                   ((unsigned int) 0x00000002) // Used to prevent accidental reset
#define SCB_AIRCR_VECTCLRACTIVE_MASK              ((unsigned int) 0x00000002)
#define SCB_AIRCR_VECTRESET                       ((unsigned int) 0x00000001)
#define SCB_AIRCR_VECTRESET_MASK                  ((unsigned int) 0x00000001)

/*  Memory Management Fault Status Register */

#define SCB_MMFSR                                 (*(pREG32 (0xE000ED28)))    
#define SCB_MMFSR_IACCVIOL_MASK                   ((unsigned int) 0x00000001) // Instruction access violation
#define SCB_MMFSR_IACCVIOL                        ((unsigned int) 0x00000001)
#define SCB_MMFSR_DACCVIOL_MASK                   ((unsigned int) 0x00000002) // Data access violation
#define SCB_MMFSR_DACCVIOL                        ((unsigned int) 0x00000002)
#define SCB_MMFSR_MUNSTKERR_MASK                  ((unsigned int) 0x00000008) // Unstacking error
#define SCB_MMFSR_MUNSTKERR                       ((unsigned int) 0x00000008)
#define SCB_MMFSR_MSTKERR_MASK                    ((unsigned int) 0x00000010) // Stacking error
#define SCB_MMFSR_MSTKERR                         ((unsigned int) 0x00000010)
#define SCB_MMFSR_MMARVALID_MASK                  ((unsigned int) 0x00000080) // Indicates MMAR is valid
#define SCB_MMFSR_MMARVALID                       ((unsigned int) 0x00000080)

/*  Bus Fault Status Register */

#define SCB_BFSR                                  (*(pREG32 (0xE000ED29)))
#define SCB_BFSR_IBUSERR_MASK                     ((unsigned int) 0x00000001) // Instruction access violation
#define SCB_BFSR_IBUSERR                          ((unsigned int) 0x00000001)
#define SCB_BFSR_PRECISERR_MASK                   ((unsigned int) 0x00000002) // Precise data access violation
#define SCB_BFSR_PRECISERR                        ((unsigned int) 0x00000002)
#define SCB_BFSR_IMPRECISERR_MASK                 ((unsigned int) 0x00000004) // Imprecise data access violation
#define SCB_BFSR_IMPRECISERR                      ((unsigned int) 0x00000004)
#define SCB_BFSR_UNSTKERR_MASK                    ((unsigned int) 0x00000008) // Unstacking error
#define SCB_BFSR_UNSTKERR                         ((unsigned int) 0x00000008)
#define SCB_BFSR_STKERR_MASK                      ((unsigned int) 0x00000010) // Stacking error
#define SCB_BFSR_STKERR                           ((unsigned int) 0x00000010)
#define SCB_BFSR_BFARVALID_MASK                   ((unsigned int) 0x00000080) // Indicates BFAR is valid
#define SCB_BFSR_BFARVALID                        ((unsigned int) 0x00000080)

/*  Usage Fault Status Register */

#define SCB_UFSR                                  (*(pREG32 (0xE000ED2A)))
#define SCB_UFSR_UNDEFINSTR_MASK                  ((unsigned int) 0x00000001) // Attempt to execute an undefined instruction
#define SCB_UFSR_UNDEFINSTR                       ((unsigned int) 0x00000001)
#define SCB_UFSR_INVSTATE_MASK                    ((unsigned int) 0x00000002) // Attempt to switch to invalid state (i.e. ARM)
#define SCB_UFSR_INVSTATE                         ((unsigned int) 0x00000002)
#define SCB_UFSR_INVPC_MASK                       ((unsigned int) 0x00000004) // Attempt to do exception with bad value in EXC_RETURN number
#define SCB_UFSR_INVPC                            ((unsigned int) 0x00000004)
#define SCB_UFSR_NOCP_MASK                        ((unsigned int) 0x00000008) // Attempt to execute a coprocessor instruction
#define SCB_UFSR_NOCP                             ((unsigned int) 0x00000008)
#define SCB_UFSR_UNALIGNED_MASK                   ((unsigned int) 0x00000100) // Unaligned access
#define SCB_UFSR_UNALIGNED                        ((unsigned int) 0x00000100)
#define SCB_UFSR_DIVBYZERO_MASK                   ((unsigned int) 0x00000200) // Divide by zero
#define SCB_UFSR_DIVBYZERO                        ((unsigned int) 0x00000200)

/*  Hard Fault Status Register */

#define SCB_HFSR                                  (*(pREG32 (0xE000ED2C)))
#define SCB_HFSR_VECTTBL_MASK                     ((unsigned int) 0x00000002) // Hard fault caused by failed vector fetch
#define SCB_HFSR_VECTTBL                          ((unsigned int) 0x00000002)
#define SCB_HFSR_FORCED_MASK                      ((unsigned int) 0x40000000) // Hard fault taken because of bus/mem man/usage fault
#define SCB_HFSR_FORCED                           ((unsigned int) 0x40000000)
#define SCB_HFSR_DEBUGEVT_MASK                    ((unsigned int) 0x80000000) // Hard fault triggered by debug event
#define SCB_HFSR_DEBUGEVT                         ((unsigned int) 0x80000000)

