r0ket/r0ket/firmware/core/lpc134x.h
/*  Debug Fault Status Register */

#define SCB_DFSR                                  (*(pREG32 (0xE000ED30)))
#define SCB_DFSR_HALTED_MASK                      ((unsigned int) 0x00000001) // Halt requested in NVIC
#define SCB_DFSR_HALTED                           ((unsigned int) 0x00000001)
#define SCB_DFSR_BKPT_MASK                        ((unsigned int) 0x00000002) // BKPT instruction executed
#define SCB_DFSR_BKPT                             ((unsigned int) 0x00000002)
#define SCB_DFSR_DWTTRAP_MASK                     ((unsigned int) 0x00000004) // DWT match occurred
#define SCB_DFSR_DWTTRAP                          ((unsigned int) 0x00000004)
#define SCB_DFSR_VCATCH_MASK                      ((unsigned int) 0x00000008) // Vector fetch occurred
#define SCB_DFSR_VCATCH                           ((unsigned int) 0x00000008)
#define SCB_DFSR_EXTERNAL_MASK                    ((unsigned int) 0x00000010) // EDBGRQ signal asserted
#define SCB_DFSR_EXTERNAL                         ((unsigned int) 0x00000010)

/*  SCB_MEMREMAP (System memory remap register)
    The system memory remap register selects whether the ARM interrupt vectors are read
    from the boot ROM, the flash, or the SRAM.  */

#define SCB_MEMREMAP_MODE_BOOTLOADER              ((unsigned int) 0x00000000) // Interrupt vectors are remapped to Boot ROM
#define SCB_MEMREMAP_MODE_RAM                     ((unsigned int) 0x00000001) // Interrupt vectors are remapped to Static ROM
#define SCB_MEMREMAP_MODE_FLASH                   ((unsigned int) 0x00000002) // Interrupt vectors are not remapped and reside in Flash
#define SCB_MEMREMAP_MASK                         ((unsigned int) 0x00000003)

/*  PRESETCTRL (Peripheral reset control register) */

#define SCB_PRESETCTRL_SSP0_RESETENABLED          ((unsigned int) 0x00000000)
#define SCB_PRESETCTRL_SSP0_RESETDISABLED         ((unsigned int) 0x00000001)
#define SCB_PRESETCTRL_SSP0_MASK                  ((unsigned int) 0x00000001)
#define SCB_PRESETCTRL_I2C_RESETENABLED           ((unsigned int) 0x00000000)
#define SCB_PRESETCTRL_I2C_RESETDISABLED          ((unsigned int) 0x00000002)
#define SCB_PRESETCTRL_I2C_MASK                   ((unsigned int) 0x00000002)

/*  SYSPLLCTRL (System PLL control register)
    This register connects and enables the system PLL and configures the PLL multiplier and
    divider values. The PLL accepts an input frequency from 10 MHz to 25 MHz from various
    clock sources. The input frequency is multiplied up to a high frequency, then divided down
    to provide the actual clock used by the CPU, peripherals, and optionally the USB
    subsystem. Note that the USB subsystem has its own dedicated PLL. The PLL can
    produce a clock up to the maximum allowed for the CPU, which is 72 MHz. */

#define SCB_PLLCTRL_MULT_1                        ((unsigned int) 0x00000000)
#define SCB_PLLCTRL_MULT_2                        ((unsigned int) 0x00000001)
#define SCB_PLLCTRL_MULT_3                        ((unsigned int) 0x00000002)
#define SCB_PLLCTRL_MULT_4                        ((unsigned int) 0x00000003)
#define SCB_PLLCTRL_MULT_5                        ((unsigned int) 0x00000004)
#define SCB_PLLCTRL_MULT_6                        ((unsigned int) 0x00000005)
#define SCB_PLLCTRL_MULT_7                        ((unsigned int) 0x00000006)
#define SCB_PLLCTRL_MULT_8                        ((unsigned int) 0x00000007)
#define SCB_PLLCTRL_MULT_9                        ((unsigned int) 0x00000008)
#define SCB_PLLCTRL_MULT_10                       ((unsigned int) 0x00000009)
#define SCB_PLLCTRL_MULT_11                       ((unsigned int) 0x0000000A)
#define SCB_PLLCTRL_MULT_12                       ((unsigned int) 0x0000000B)
#define SCB_PLLCTRL_MULT_13                       ((unsigned int) 0x0000000C)
#define SCB_PLLCTRL_MULT_14                       ((unsigned int) 0x0000000D)
#define SCB_PLLCTRL_MULT_15                       ((unsigned int) 0x0000000E)
#define SCB_PLLCTRL_MULT_16                       ((unsigned int) 0x0000000F)
#define SCB_PLLCTRL_MULT_17                       ((unsigned int) 0x00000010)
#define SCB_PLLCTRL_MULT_18                       ((unsigned int) 0x00000011)
#define SCB_PLLCTRL_MULT_19                       ((unsigned int) 0x00000012)
#define SCB_PLLCTRL_MULT_20                       ((unsigned int) 0x00000013)
#define SCB_PLLCTRL_MULT_21                       ((unsigned int) 0x00000014)
#define SCB_PLLCTRL_MULT_22                       ((unsigned int) 0x00000015)
#define SCB_PLLCTRL_MULT_23                       ((unsigned int) 0x00000016)
#define SCB_PLLCTRL_MULT_24                       ((unsigned int) 0x00000017)
#define SCB_PLLCTRL_MULT_25                       ((unsigned int) 0x00000018)
#define SCB_PLLCTRL_MULT_26                       ((unsigned int) 0x00000019)
#define SCB_PLLCTRL_MULT_27                       ((unsigned int) 0x0000001A)
#define SCB_PLLCTRL_MULT_28                       ((unsigned int) 0x0000001B)
#define SCB_PLLCTRL_MULT_29                       ((unsigned int) 0x0000001C)
#define SCB_PLLCTRL_MULT_30                       ((unsigned int) 0x0000001D)
#define SCB_PLLCTRL_MULT_31                       ((unsigned int) 0x0000001E)
#define SCB_PLLCTRL_MULT_32                       ((unsigned int) 0x0000001F)
#define SCB_PLLCTRL_MULT_MASK                     ((unsigned int) 0x0000001F)    
#define SCB_PLLCTRL_DIV_2                         ((unsigned int) 0x00000000)       
#define SCB_PLLCTRL_DIV_4                         ((unsigned int) 0x00000020)       
#define SCB_PLLCTRL_DIV_8                         ((unsigned int) 0x00000040)       
#define SCB_PLLCTRL_DIV_16                        ((unsigned int) 0x00000060)
#define SCB_PLLCTRL_DIV_BIT                       (5)
#define SCB_PLLCTRL_DIV_MASK                      ((unsigned int) 0x00000060)    
#define SCB_PLLCTRL_DIRECT_MASK                   ((unsigned int) 0x00000080) // Direct CCO clock output control
#define SCB_PLLCTRL_BYPASS_MASK                   ((unsigned int) 0x00000100) // Input clock bypass control
#define SCB_PLLCTRL_MASK                          ((unsigned int) 0x000001FF)    

/*  SYSPLLSTAT (System PLL status register)
    This register is a Read-only register and supplies the PLL lock status */

#define SCB_PLLSTAT_LOCK                          ((unsigned int) 0x00000001) // 0 = PLL not locked, 1 = PLL locked
#define SCB_PLLSTAT_LOCK_MASK                     ((unsigned int) 0x00000001)    

/*  USBPLLCTRL (USB PLL control register)
    The USB PLL is identical to the system PLL and is used to provide a dedicated clock to
    the USB block if available.  The USB PLL should be always connected to the system
    oscillator to produce a stable USB clock. */

#define SCB_USBPLLCTRL_MULT_1                     ((unsigned int) 0x00000000)
#define SCB_USBPLLCTRL_MULT_2                     ((unsigned int) 0x00000001)
#define SCB_USBPLLCTRL_MULT_3                     ((unsigned int) 0x00000002)
#define SCB_USBPLLCTRL_MULT_4                     ((unsigned int) 0x00000003)
#define SCB_USBPLLCTRL_MULT_5                     ((unsigned int) 0x00000004)
#define SCB_USBPLLCTRL_MULT_6                     ((unsigned int) 0x00000005)
#define SCB_USBPLLCTRL_MULT_7                     ((unsigned int) 0x00000006)
#define SCB_USBPLLCTRL_MULT_8                     ((unsigned int) 0x00000007)
#define SCB_USBPLLCTRL_MULT_9                     ((unsigned int) 0x00000008)
#define SCB_USBPLLCTRL_MULT_10                    ((unsigned int) 0x00000009)
#define SCB_USBPLLCTRL_MULT_11                    ((unsigned int) 0x0000000A)
#define SCB_USBPLLCTRL_MULT_12                    ((unsigned int) 0x0000000B)
#define SCB_USBPLLCTRL_MULT_13                    ((unsigned int) 0x0000000C)
#define SCB_USBPLLCTRL_MULT_14                    ((unsigned int) 0x0000000D)
#define SCB_USBPLLCTRL_MULT_15                    ((unsigned int) 0x0000000E)
#define SCB_USBPLLCTRL_MULT_16                    ((unsigned int) 0x0000000F)
#define SCB_USBPLLCTRL_MULT_17                    ((unsigned int) 0x00000010)
#define SCB_USBPLLCTRL_MULT_18                    ((unsigned int) 0x00000011)
#define SCB_USBPLLCTRL_MULT_19                    ((unsigned int) 0x00000012)
#define SCB_USBPLLCTRL_MULT_20                    ((unsigned int) 0x00000013)
#define SCB_USBPLLCTRL_MULT_21                    ((unsigned int) 0x00000014)
#define SCB_USBPLLCTRL_MULT_22                    ((unsigned int) 0x00000015)
#define SCB_USBPLLCTRL_MULT_23                    ((unsigned int) 0x00000016)
#define SCB_USBPLLCTRL_MULT_24                    ((unsigned int) 0x00000017)
#define SCB_USBPLLCTRL_MULT_25                    ((unsigned int) 0x00000018)
#define SCB_USBPLLCTRL_MULT_26                    ((unsigned int) 0x00000019)
#define SCB_USBPLLCTRL_MULT_27                    ((unsigned int) 0x0000001A)
#define SCB_USBPLLCTRL_MULT_28                    ((unsigned int) 0x0000001B)
#define SCB_USBPLLCTRL_MULT_29                    ((unsigned int) 0x0000001C)
#define SCB_USBPLLCTRL_MULT_30                    ((unsigned int) 0x0000001D)
#define SCB_USBPLLCTRL_MULT_31                    ((unsigned int) 0x0000001E)
#define SCB_USBPLLCTRL_MULT_32                    ((unsigned int) 0x0000001F)
#define SCB_USBPLLCTRL_MULT_MASK                  ((unsigned int) 0x0000001F)    
#define SCB_USBPLLCTRL_DIV_2                      ((unsigned int) 0x00000000)       
#define SCB_USBPLLCTRL_DIV_4                      ((unsigned int) 0x00000020)       
#define SCB_USBPLLCTRL_DIV_8                      ((unsigned int) 0x00000040)       
#define SCB_USBPLLCTRL_DIV_16                     ((unsigned int) 0x00000060)
#define SCB_USBPLLCTRL_DIV_BIT                    (5)
#define SCB_USBPLLCTRL_DIV_MASK                   ((unsigned int) 0x00000060)    
#define SCB_USBPLLCTRL_DIRECT_MASK                ((unsigned int) 0x00000080) // Direct CCO clock output control
#define SCB_USBPLLCTRL_BYPASS_MASK                ((unsigned int) 0x00000100) // Input clock bypass control
#define SCB_USBPLLCTRL_MASK                       ((unsigned int) 0x000001FF)    

