r0ket/r0ket/firmware/core/lpc134x.h
/*  STARTAPRP0 (Start logic edge control register 0)
    The STARTAPRP0 register controls the start logic inputs of ports 0 (PIO0_0 to PIO0_11)
    and 1 (PIO1_0 to PIO1_11) and the lower 8 inputs of port 2 (PIO2_0 to PIO2_7). This
    register selects a falling or rising edge on the corresponding PIO input to produce a falling
    or rising clock edge, respectively, for the start logic (see Section 39.3).
    Every bit in the STARTAPRP0 register controls one port input and is connected to one
    wake-up interrupt in the NVIC. Bit 0 in the STARTAPRP0 register corresponds to interrupt
    0, bit 1 to interrupt 1, etc.. The bottom 32 interrupts are contained this register,
    the top 8 interrupts are contained in the STARTAPRP1 register for total of 40 wake-up
    interrupts.
    Remark: Each interrupt connected to a start logic input must be enabled in the NVIC if the
    corresponding PIO pin is used to wake up the chip from Deep-sleep mode. */

#define SCB_STARTAPRP0_APRPIO0_0                  ((unsigned int) 0x00000001)
#define SCB_STARTAPRP0_APRPIO0_0_MASK             ((unsigned int) 0x00000001)
#define SCB_STARTAPRP0_APRPIO0_1                  ((unsigned int) 0x00000002)
#define SCB_STARTAPRP0_APRPIO0_1_MASK             ((unsigned int) 0x00000002)
#define SCB_STARTAPRP0_APRPIO0_2                  ((unsigned int) 0x00000004)
#define SCB_STARTAPRP0_APRPIO0_2_MASK             ((unsigned int) 0x00000004)
#define SCB_STARTAPRP0_APRPIO0_3                  ((unsigned int) 0x00000008)
#define SCB_STARTAPRP0_APRPIO0_3_MASK             ((unsigned int) 0x00000008)
#define SCB_STARTAPRP0_APRPIO0_4                  ((unsigned int) 0x00000010)
#define SCB_STARTAPRP0_APRPIO0_4_MASK             ((unsigned int) 0x00000010)
#define SCB_STARTAPRP0_APRPIO0_5                  ((unsigned int) 0x00000020)
#define SCB_STARTAPRP0_APRPIO0_5_MASK             ((unsigned int) 0x00000020)
#define SCB_STARTAPRP0_APRPIO0_6                  ((unsigned int) 0x00000040)
#define SCB_STARTAPRP0_APRPIO0_6_MASK             ((unsigned int) 0x00000040)
#define SCB_STARTAPRP0_APRPIO0_7                  ((unsigned int) 0x00000080)
#define SCB_STARTAPRP0_APRPIO0_7_MASK             ((unsigned int) 0x00000080)
#define SCB_STARTAPRP0_APRPIO0_8                  ((unsigned int) 0x00000100)
#define SCB_STARTAPRP0_APRPIO0_8_MASK             ((unsigned int) 0x00000100)
#define SCB_STARTAPRP0_APRPIO0_9                  ((unsigned int) 0x00000200)
#define SCB_STARTAPRP0_APRPIO0_9_MASK             ((unsigned int) 0x00000200)
#define SCB_STARTAPRP0_APRPIO0_10                 ((unsigned int) 0x00000400)
#define SCB_STARTAPRP0_APRPIO0_10_MASK            ((unsigned int) 0x00000400)
#define SCB_STARTAPRP0_APRPIO0_11                 ((unsigned int) 0x00000800)
#define SCB_STARTAPRP0_APRPIO0_11_MASK            ((unsigned int) 0x00000800)
#define SCB_STARTAPRP0_APRPIO1_0                  ((unsigned int) 0x00001000)
#define SCB_STARTAPRP0_APRPIO1_0_MASK             ((unsigned int) 0x00001000)
#define SCB_STARTAPRP0_APRPIO1_1                  ((unsigned int) 0x00002000)
#define SCB_STARTAPRP0_APRPIO1_1_MASK             ((unsigned int) 0x00002000)
#define SCB_STARTAPRP0_APRPIO1_2                  ((unsigned int) 0x00004000)
#define SCB_STARTAPRP0_APRPIO1_2_MASK             ((unsigned int) 0x00004000)
#define SCB_STARTAPRP0_APRPIO1_3                  ((unsigned int) 0x00008000)
#define SCB_STARTAPRP0_APRPIO1_3_MASK             ((unsigned int) 0x00008000)
#define SCB_STARTAPRP0_APRPIO1_4                  ((unsigned int) 0x00010000)
#define SCB_STARTAPRP0_APRPIO1_4_MASK             ((unsigned int) 0x00010000)
#define SCB_STARTAPRP0_APRPIO1_5                  ((unsigned int) 0x00020000)
#define SCB_STARTAPRP0_APRPIO1_5_MASK             ((unsigned int) 0x00020000)
#define SCB_STARTAPRP0_APRPIO1_6                  ((unsigned int) 0x00040000)
#define SCB_STARTAPRP0_APRPIO1_6_MASK             ((unsigned int) 0x00040000)
#define SCB_STARTAPRP0_APRPIO1_7                  ((unsigned int) 0x00080000)
#define SCB_STARTAPRP0_APRPIO1_7_MASK             ((unsigned int) 0x00080000)
#define SCB_STARTAPRP0_APRPIO1_8                  ((unsigned int) 0x00100000)
#define SCB_STARTAPRP0_APRPIO1_8_MASK             ((unsigned int) 0x00100000)
#define SCB_STARTAPRP0_APRPIO1_9                  ((unsigned int) 0x00200000)
#define SCB_STARTAPRP0_APRPIO1_9_MASK             ((unsigned int) 0x00200000)
#define SCB_STARTAPRP0_APRPIO1_10                 ((unsigned int) 0x00400000)
#define SCB_STARTAPRP0_APRPIO1_10_MASK            ((unsigned int) 0x00400000)
#define SCB_STARTAPRP0_APRPIO1_11                 ((unsigned int) 0x00800000)
#define SCB_STARTAPRP0_APRPIO1_11_MASK            ((unsigned int) 0x00800000)
#define SCB_STARTAPRP0_APRPIO2_0                  ((unsigned int) 0x01000000)
#define SCB_STARTAPRP0_APRPIO2_0_MASK             ((unsigned int) 0x01000000)
#define SCB_STARTAPRP0_APRPIO2_1                  ((unsigned int) 0x02000000)
#define SCB_STARTAPRP0_APRPIO2_1_MASK             ((unsigned int) 0x02000000)
#define SCB_STARTAPRP0_APRPIO2_2                  ((unsigned int) 0x04000000)
#define SCB_STARTAPRP0_APRPIO2_2_MASK             ((unsigned int) 0x04000000)
#define SCB_STARTAPRP0_APRPIO2_3                  ((unsigned int) 0x08000000)
#define SCB_STARTAPRP0_APRPIO2_3_MASK             ((unsigned int) 0x08000000)
#define SCB_STARTAPRP0_APRPIO2_4                  ((unsigned int) 0x10000000)
#define SCB_STARTAPRP0_APRPIO2_4_MASK             ((unsigned int) 0x10000000)
#define SCB_STARTAPRP0_APRPIO2_5                  ((unsigned int) 0x20000000)
#define SCB_STARTAPRP0_APRPIO2_5_MASK             ((unsigned int) 0x20000000)
#define SCB_STARTAPRP0_APRPIO2_6                  ((unsigned int) 0x40000000)
#define SCB_STARTAPRP0_APRPIO2_6_MASK             ((unsigned int) 0x40000000)
#define SCB_STARTAPRP0_APRPIO2_7                  ((unsigned int) 0x80000000)
#define SCB_STARTAPRP0_APRPIO2_7_MASK             ((unsigned int) 0x80000000)
#define SCB_STARTAPRP0_MASK                       ((unsigned int) 0xFFFFFFFF)

