r0ket/r0ket/firmware/core/lpc134x.h
/*  STARTERP0 (Start logic signal enable register 0)
    This STARTERP0 register enables or disables the start signal bits in the start logic.  */

#define SCB_STARTERP0_ERPIO0_0                    ((unsigned int) 0x00000001)
#define SCB_STARTERP0_ERPIO0_0_MASK               ((unsigned int) 0x00000001)
#define SCB_STARTERP0_ERPIO0_1                    ((unsigned int) 0x00000002)
#define SCB_STARTERP0_ERPIO0_1_MASK               ((unsigned int) 0x00000002)
#define SCB_STARTERP0_ERPIO0_2                    ((unsigned int) 0x00000004)
#define SCB_STARTERP0_ERPIO0_2_MASK               ((unsigned int) 0x00000004)
#define SCB_STARTERP0_ERPIO0_3                    ((unsigned int) 0x00000008)
#define SCB_STARTERP0_ERPIO0_3_MASK               ((unsigned int) 0x00000008)
#define SCB_STARTERP0_ERPIO0_4                    ((unsigned int) 0x00000010)
#define SCB_STARTERP0_ERPIO0_4_MASK               ((unsigned int) 0x00000010)
#define SCB_STARTERP0_ERPIO0_5                    ((unsigned int) 0x00000020)
#define SCB_STARTERP0_ERPIO0_5_MASK               ((unsigned int) 0x00000020)
#define SCB_STARTERP0_ERPIO0_6                    ((unsigned int) 0x00000040)
#define SCB_STARTERP0_ERPIO0_6_MASK               ((unsigned int) 0x00000040)
#define SCB_STARTERP0_ERPIO0_7                    ((unsigned int) 0x00000080)
#define SCB_STARTERP0_ERPIO0_7_MASK               ((unsigned int) 0x00000080)
#define SCB_STARTERP0_ERPIO0_8                    ((unsigned int) 0x00000100)
#define SCB_STARTERP0_ERPIO0_8_MASK               ((unsigned int) 0x00000100)
#define SCB_STARTERP0_ERPIO0_9                    ((unsigned int) 0x00000200)
#define SCB_STARTERP0_ERPIO0_9_MASK               ((unsigned int) 0x00000200)
#define SCB_STARTERP0_ERPIO0_10                   ((unsigned int) 0x00000400)
#define SCB_STARTERP0_ERPIO0_10_MASK              ((unsigned int) 0x00000400)
#define SCB_STARTERP0_ERPIO0_11                   ((unsigned int) 0x00000800)
#define SCB_STARTERP0_ERPIO0_11_MASK              ((unsigned int) 0x00000800)
#define SCB_STARTERP0_ERPIO1_0                    ((unsigned int) 0x00001000)
#define SCB_STARTERP0_ERPIO1_0_MASK               ((unsigned int) 0x00001000)
#define SCB_STARTERP0_ERPIO1_1                    ((unsigned int) 0x00002000)
#define SCB_STARTERP0_ERPIO1_1_MASK               ((unsigned int) 0x00002000)
#define SCB_STARTERP0_ERPIO1_2                    ((unsigned int) 0x00004000)
#define SCB_STARTERP0_ERPIO1_2_MASK               ((unsigned int) 0x00004000)
#define SCB_STARTERP0_ERPIO1_3                    ((unsigned int) 0x00008000)
#define SCB_STARTERP0_ERPIO1_3_MASK               ((unsigned int) 0x00008000)
#define SCB_STARTERP0_ERPIO1_4                    ((unsigned int) 0x00010000)
#define SCB_STARTERP0_ERPIO1_4_MASK               ((unsigned int) 0x00010000)
#define SCB_STARTERP0_ERPIO1_5                    ((unsigned int) 0x00020000)
#define SCB_STARTERP0_ERPIO1_5_MASK               ((unsigned int) 0x00020000)
#define SCB_STARTERP0_ERPIO1_6                    ((unsigned int) 0x00040000)
#define SCB_STARTERP0_ERPIO1_6_MASK               ((unsigned int) 0x00040000)
#define SCB_STARTERP0_ERPIO1_7                    ((unsigned int) 0x00080000)
#define SCB_STARTERP0_ERPIO1_7_MASK               ((unsigned int) 0x00080000)
#define SCB_STARTERP0_ERPIO1_8                    ((unsigned int) 0x00100000)
#define SCB_STARTERP0_ERPIO1_8_MASK               ((unsigned int) 0x00100000)
#define SCB_STARTERP0_ERPIO1_9                    ((unsigned int) 0x00200000)
#define SCB_STARTERP0_ERPIO1_9_MASK               ((unsigned int) 0x00200000)
#define SCB_STARTERP0_ERPIO1_10                   ((unsigned int) 0x00400000)
#define SCB_STARTERP0_ERPIO1_10_MASK              ((unsigned int) 0x00400000)
#define SCB_STARTERP0_ERPIO1_11                   ((unsigned int) 0x00800000)
#define SCB_STARTERP0_ERPIO1_11_MASK              ((unsigned int) 0x00800000)
#define SCB_STARTERP0_ERPIO2_0                    ((unsigned int) 0x01000000)
#define SCB_STARTERP0_ERPIO2_0_MASK               ((unsigned int) 0x01000000)
#define SCB_STARTERP0_ERPIO2_1                    ((unsigned int) 0x02000000)
#define SCB_STARTERP0_ERPIO2_1_MASK               ((unsigned int) 0x02000000)
#define SCB_STARTERP0_ERPIO2_2                    ((unsigned int) 0x04000000)
#define SCB_STARTERP0_ERPIO2_2_MASK               ((unsigned int) 0x04000000)
#define SCB_STARTERP0_ERPIO2_3                    ((unsigned int) 0x08000000)
#define SCB_STARTERP0_ERPIO2_3_MASK               ((unsigned int) 0x08000000)
#define SCB_STARTERP0_ERPIO2_4                    ((unsigned int) 0x10000000)
#define SCB_STARTERP0_ERPIO2_4_MASK               ((unsigned int) 0x10000000)
#define SCB_STARTERP0_ERPIO2_5                    ((unsigned int) 0x20000000)
#define SCB_STARTERP0_ERPIO2_5_MASK               ((unsigned int) 0x20000000)
#define SCB_STARTERP0_ERPIO2_6                    ((unsigned int) 0x40000000)
#define SCB_STARTERP0_ERPIO2_6_MASK               ((unsigned int) 0x40000000)
#define SCB_STARTERP0_ERPIO2_7                    ((unsigned int) 0x80000000)
#define SCB_STARTERP0_ERPIO2_7_MASK               ((unsigned int) 0x80000000)
#define SCB_STARTERP0_MASK                        ((unsigned int) 0xFFFFFFFF)

/*  STARTRSRP0CLR (Start logic reset register 0)
    Writing a one to a bit in the STARTRSRP0CLR register resets the start logic state. The
    start-up logic uses the input signals to generate a clock edge for registering a start
    signal. This clock edge (falling or rising) sets the interrupt for waking up from
    Deep-sleep mode. Therefore, the start-up logic states must be cleared before being used. */

#define SCB_STARTRSRP0CLR_RSRPIO0_0               ((unsigned int) 0x00000001)
#define SCB_STARTRSRP0CLR_RSRPIO0_0_MASK          ((unsigned int) 0x00000001)
#define SCB_STARTRSRP0CLR_RSRPIO0_1               ((unsigned int) 0x00000002)
#define SCB_STARTRSRP0CLR_RSRPIO0_1_MASK          ((unsigned int) 0x00000002)
#define SCB_STARTRSRP0CLR_RSRPIO0_2               ((unsigned int) 0x00000004)
#define SCB_STARTRSRP0CLR_RSRPIO0_2_MASK          ((unsigned int) 0x00000004)
#define SCB_STARTRSRP0CLR_RSRPIO0_3               ((unsigned int) 0x00000008)
#define SCB_STARTRSRP0CLR_RSRPIO0_3_MASK          ((unsigned int) 0x00000008)
#define SCB_STARTRSRP0CLR_RSRPIO0_4               ((unsigned int) 0x00000010)
#define SCB_STARTRSRP0CLR_RSRPIO0_4_MASK          ((unsigned int) 0x00000010)
#define SCB_STARTRSRP0CLR_RSRPIO0_5               ((unsigned int) 0x00000020)
#define SCB_STARTRSRP0CLR_RSRPIO0_5_MASK          ((unsigned int) 0x00000020)
#define SCB_STARTRSRP0CLR_RSRPIO0_6               ((unsigned int) 0x00000040)
#define SCB_STARTRSRP0CLR_RSRPIO0_6_MASK          ((unsigned int) 0x00000040)
#define SCB_STARTRSRP0CLR_RSRPIO0_7               ((unsigned int) 0x00000080)
#define SCB_STARTRSRP0CLR_RSRPIO0_7_MASK          ((unsigned int) 0x00000080)
#define SCB_STARTRSRP0CLR_RSRPIO0_8               ((unsigned int) 0x00000100)
#define SCB_STARTRSRP0CLR_RSRPIO0_8_MASK          ((unsigned int) 0x00000100)
#define SCB_STARTRSRP0CLR_RSRPIO0_9               ((unsigned int) 0x00000200)
#define SCB_STARTRSRP0CLR_RSRPIO0_9_MASK          ((unsigned int) 0x00000200)
#define SCB_STARTRSRP0CLR_RSRPIO0_10              ((unsigned int) 0x00000400)
#define SCB_STARTRSRP0CLR_RSRPIO0_10_MASK         ((unsigned int) 0x00000400)
#define SCB_STARTRSRP0CLR_RSRPIO0_11              ((unsigned int) 0x00000800)
#define SCB_STARTRSRP0CLR_RSRPIO0_11_MASK         ((unsigned int) 0x00000800)
#define SCB_STARTRSRP0CLR_RSRPIO1_0               ((unsigned int) 0x00001000)
#define SCB_STARTRSRP0CLR_RSRPIO1_0_MASK          ((unsigned int) 0x00001000)
#define SCB_STARTRSRP0CLR_RSRPIO1_1               ((unsigned int) 0x00002000)
#define SCB_STARTRSRP0CLR_RSRPIO1_1_MASK          ((unsigned int) 0x00002000)
#define SCB_STARTRSRP0CLR_RSRPIO1_2               ((unsigned int) 0x00004000)
#define SCB_STARTRSRP0CLR_RSRPIO1_2_MASK          ((unsigned int) 0x00004000)
#define SCB_STARTRSRP0CLR_RSRPIO1_3               ((unsigned int) 0x00008000)
#define SCB_STARTRSRP0CLR_RSRPIO1_3_MASK          ((unsigned int) 0x00008000)
#define SCB_STARTRSRP0CLR_RSRPIO1_4               ((unsigned int) 0x00010000)
#define SCB_STARTRSRP0CLR_RSRPIO1_4_MASK          ((unsigned int) 0x00010000)
#define SCB_STARTRSRP0CLR_RSRPIO1_5               ((unsigned int) 0x00020000)
#define SCB_STARTRSRP0CLR_RSRPIO1_5_MASK          ((unsigned int) 0x00020000)
#define SCB_STARTRSRP0CLR_RSRPIO1_6               ((unsigned int) 0x00040000)
#define SCB_STARTRSRP0CLR_RSRPIO1_6_MASK          ((unsigned int) 0x00040000)
#define SCB_STARTRSRP0CLR_RSRPIO1_7               ((unsigned int) 0x00080000)
#define SCB_STARTRSRP0CLR_RSRPIO1_7_MASK          ((unsigned int) 0x00080000)
#define SCB_STARTRSRP0CLR_RSRPIO1_8               ((unsigned int) 0x00100000)
#define SCB_STARTRSRP0CLR_RSRPIO1_8_MASK          ((unsigned int) 0x00100000)
#define SCB_STARTRSRP0CLR_RSRPIO1_9               ((unsigned int) 0x00200000)
#define SCB_STARTRSRP0CLR_RSRPIO1_9_MASK          ((unsigned int) 0x00200000)
#define SCB_STARTRSRP0CLR_RSRPIO1_10              ((unsigned int) 0x00400000)
#define SCB_STARTRSRP0CLR_RSRPIO1_10_MASK         ((unsigned int) 0x00400000)
#define SCB_STARTRSRP0CLR_RSRPIO1_11              ((unsigned int) 0x00800000)
#define SCB_STARTRSRP0CLR_RSRPIO1_11_MASK         ((unsigned int) 0x00800000)
#define SCB_STARTRSRP0CLR_RSRPIO2_0               ((unsigned int) 0x01000000)
#define SCB_STARTRSRP0CLR_RSRPIO2_0_MASK          ((unsigned int) 0x01000000)
#define SCB_STARTRSRP0CLR_RSRPIO2_1               ((unsigned int) 0x02000000)
#define SCB_STARTRSRP0CLR_RSRPIO2_1_MASK          ((unsigned int) 0x02000000)
#define SCB_STARTRSRP0CLR_RSRPIO2_2               ((unsigned int) 0x04000000)
#define SCB_STARTRSRP0CLR_RSRPIO2_2_MASK          ((unsigned int) 0x04000000)
#define SCB_STARTRSRP0CLR_RSRPIO2_3               ((unsigned int) 0x08000000)
#define SCB_STARTRSRP0CLR_RSRPIO2_3_MASK          ((unsigned int) 0x08000000)
#define SCB_STARTRSRP0CLR_RSRPIO2_4               ((unsigned int) 0x10000000)
#define SCB_STARTRSRP0CLR_RSRPIO2_4_MASK          ((unsigned int) 0x10000000)
#define SCB_STARTRSRP0CLR_RSRPIO2_5               ((unsigned int) 0x20000000)
#define SCB_STARTRSRP0CLR_RSRPIO2_5_MASK          ((unsigned int) 0x20000000)
#define SCB_STARTRSRP0CLR_RSRPIO2_6               ((unsigned int) 0x40000000)
#define SCB_STARTRSRP0CLR_RSRPIO2_6_MASK          ((unsigned int) 0x40000000)
#define SCB_STARTRSRP0CLR_RSRPIO2_7               ((unsigned int) 0x80000000)
#define SCB_STARTRSRP0CLR_RSRPIO2_7_MASK          ((unsigned int) 0x80000000)
#define SCB_STARTRSRP0CLR_MASK                    ((unsigned int) 0xFFFFFFFF)

/*  (Start logic status register 0)
    This register reflects the status of the enabled start signal bits. Each bit
    (if enabled) reflects the state of the start logic, i.e. whether or not a
    wake-up signal has been received for a given pin.  */

#define SCB_STARTSRP0_SRPIO0_0                    ((unsigned int) 0x00000001)
#define SCB_STARTSRP0_SRPIO0_0_MASK               ((unsigned int) 0x00000001)
#define SCB_STARTSRP0_SRPIO0_1                    ((unsigned int) 0x00000002)
#define SCB_STARTSRP0_SRPIO0_1_MASK               ((unsigned int) 0x00000002)
#define SCB_STARTSRP0_SRPIO0_2                    ((unsigned int) 0x00000004)
#define SCB_STARTSRP0_SRPIO0_2_MASK               ((unsigned int) 0x00000004)
#define SCB_STARTSRP0_SRPIO0_3                    ((unsigned int) 0x00000008)
#define SCB_STARTSRP0_SRPIO0_3_MASK               ((unsigned int) 0x00000008)
#define SCB_STARTSRP0_SRPIO0_4                    ((unsigned int) 0x00000010)
#define SCB_STARTSRP0_SRPIO0_4_MASK               ((unsigned int) 0x00000010)
#define SCB_STARTSRP0_SRPIO0_5                    ((unsigned int) 0x00000020)
#define SCB_STARTSRP0_SRPIO0_5_MASK               ((unsigned int) 0x00000020)
#define SCB_STARTSRP0_SRPIO0_6                    ((unsigned int) 0x00000040)
#define SCB_STARTSRP0_SRPIO0_6_MASK               ((unsigned int) 0x00000040)
#define SCB_STARTSRP0_SRPIO0_7                    ((unsigned int) 0x00000080)
#define SCB_STARTSRP0_SRPIO0_7_MASK               ((unsigned int) 0x00000080)
#define SCB_STARTSRP0_SRPIO0_8                    ((unsigned int) 0x00000100)
#define SCB_STARTSRP0_SRPIO0_8_MASK               ((unsigned int) 0x00000100)
#define SCB_STARTSRP0_SRPIO0_9                    ((unsigned int) 0x00000200)
#define SCB_STARTSRP0_SRPIO0_9_MASK               ((unsigned int) 0x00000200)
#define SCB_STARTSRP0_SRPIO0_10                   ((unsigned int) 0x00000400)
#define SCB_STARTSRP0_SRPIO0_10_MASK              ((unsigned int) 0x00000400)
#define SCB_STARTSRP0_SRPIO0_11                   ((unsigned int) 0x00000800)
#define SCB_STARTSRP0_SRPIO0_11_MASK              ((unsigned int) 0x00000800)
#define SCB_STARTSRP0_SRPIO1_0                    ((unsigned int) 0x00001000)
#define SCB_STARTSRP0_SRPIO1_0_MASK               ((unsigned int) 0x00001000)
#define SCB_STARTSRP0_SRPIO1_1                    ((unsigned int) 0x00002000)
#define SCB_STARTSRP0_SRPIO1_1_MASK               ((unsigned int) 0x00002000)
#define SCB_STARTSRP0_SRPIO1_2                    ((unsigned int) 0x00004000)
#define SCB_STARTSRP0_SRPIO1_2_MASK               ((unsigned int) 0x00004000)
#define SCB_STARTSRP0_SRPIO1_3                    ((unsigned int) 0x00008000)
#define SCB_STARTSRP0_SRPIO1_3_MASK               ((unsigned int) 0x00008000)
#define SCB_STARTSRP0_SRPIO1_4                    ((unsigned int) 0x00010000)
#define SCB_STARTSRP0_SRPIO1_4_MASK               ((unsigned int) 0x00010000)
#define SCB_STARTSRP0_SRPIO1_5                    ((unsigned int) 0x00020000)
#define SCB_STARTSRP0_SRPIO1_5_MASK               ((unsigned int) 0x00020000)
#define SCB_STARTSRP0_SRPIO1_6                    ((unsigned int) 0x00040000)
#define SCB_STARTSRP0_SRPIO1_6_MASK               ((unsigned int) 0x00040000)
#define SCB_STARTSRP0_SRPIO1_7                    ((unsigned int) 0x00080000)
#define SCB_STARTSRP0_SRPIO1_7_MASK               ((unsigned int) 0x00080000)
#define SCB_STARTSRP0_SRPIO1_8                    ((unsigned int) 0x00100000)
#define SCB_STARTSRP0_SRPIO1_8_MASK               ((unsigned int) 0x00100000)
#define SCB_STARTSRP0_SRPIO1_9                    ((unsigned int) 0x00200000)
#define SCB_STARTSRP0_SRPIO1_9_MASK               ((unsigned int) 0x00200000)
#define SCB_STARTSRP0_SRPIO1_10                   ((unsigned int) 0x00400000)
#define SCB_STARTSRP0_SRPIO1_10_MASK              ((unsigned int) 0x00400000)
#define SCB_STARTSRP0_SRPIO1_11                   ((unsigned int) 0x00800000)
#define SCB_STARTSRP0_SRPIO1_11_MASK              ((unsigned int) 0x00800000)
#define SCB_STARTSRP0_SRPIO2_0                    ((unsigned int) 0x01000000)
#define SCB_STARTSRP0_SRPIO2_0_MASK               ((unsigned int) 0x01000000)
#define SCB_STARTSRP0_SRPIO2_1                    ((unsigned int) 0x02000000)
#define SCB_STARTSRP0_SRPIO2_1_MASK               ((unsigned int) 0x02000000)
#define SCB_STARTSRP0_SRPIO2_2                    ((unsigned int) 0x04000000)
#define SCB_STARTSRP0_SRPIO2_2_MASK               ((unsigned int) 0x04000000)
#define SCB_STARTSRP0_SRPIO2_3                    ((unsigned int) 0x08000000)
#define SCB_STARTSRP0_SRPIO2_3_MASK               ((unsigned int) 0x08000000)
#define SCB_STARTSRP0_SRPIO2_4                    ((unsigned int) 0x10000000)
#define SCB_STARTSRP0_SRPIO2_4_MASK               ((unsigned int) 0x10000000)
#define SCB_STARTSRP0_SRPIO2_5                    ((unsigned int) 0x20000000)
#define SCB_STARTSRP0_SRPIO2_5_MASK               ((unsigned int) 0x20000000)
#define SCB_STARTSRP0_SRPIO2_6                    ((unsigned int) 0x40000000)
#define SCB_STARTSRP0_SRPIO2_6_MASK               ((unsigned int) 0x40000000)
#define SCB_STARTSRP0_SRPIO2_7                    ((unsigned int) 0x80000000)
#define SCB_STARTSRP0_SRPIO2_7_MASK               ((unsigned int) 0x80000000)
#define SCB_STARTSRP0_MASK                        ((unsigned int) 0xFFFFFFFF)


