r0ket/r0ket/firmware/core/lpc134x.h
/*  STARTAPRP1 (Start logic edge control register 1)
    The STARTAPRP1 register controls the start logic inputs of ports 2 (PIO2_8 to PIO2_11)
    and 3 (PIO3_0 to PIO3_3). This register selects a falling or rising edge on the
    corresponding PIO input to produce a falling or rising clock edge, respectively, for the
    start-up logic.
    Every bit in the STARTAPRP1 register controls one port input and is connected to one
    wake-up interrupt in the NVIC. Bit 0 in the STARTAPRP1 register corresponds to interrupt
    32, bit 1 to interrupt 33, up to bit 7 corresponding to interrupt 39.
    Remark: Each interrupt connected to a start logic input must be enabled in the NVIC if the
    corresponding PIO pin is used to wake up the chip from Deep-sleep mode.*/

#define SCB_STARTAPRP1_APRPIO2_8                  ((unsigned int) 0x00000001)
#define SCB_STARTAPRP1_APRPIO2_8_MASK             ((unsigned int) 0x00000001)
#define SCB_STARTAPRP1_APRPIO2_8                  ((unsigned int) 0x00000001)
#define SCB_STARTAPRP1_APRPIO2_9_MASK             ((unsigned int) 0x00000002)
#define SCB_STARTAPRP1_APRPIO2_10                 ((unsigned int) 0x00000004)
#define SCB_STARTAPRP1_APRPIO2_10_MASK            ((unsigned int) 0x00000004)
#define SCB_STARTAPRP1_APRPIO2_11                 ((unsigned int) 0x00000008)
#define SCB_STARTAPRP1_APRPIO2_11_MASK            ((unsigned int) 0x00000008)
#define SCB_STARTAPRP1_APRPIO3_0                  ((unsigned int) 0x00000010)
#define SCB_STARTAPRP1_APRPIO3_0_MASK             ((unsigned int) 0x00000010)
#define SCB_STARTAPRP1_APRPIO3_1                  ((unsigned int) 0x00000020)
#define SCB_STARTAPRP1_APRPIO3_1_MASK             ((unsigned int) 0x00000020)
#define SCB_STARTAPRP1_APRPIO3_2                  ((unsigned int) 0x00000040)
#define SCB_STARTAPRP1_APRPIO3_2_MASK             ((unsigned int) 0x00000040)
#define SCB_STARTAPRP1_APRPIO3_3                  ((unsigned int) 0x00000080)
#define SCB_STARTAPRP1_APRPIO3_3_MASK             ((unsigned int) 0x00000080)
#define SCB_STARTAPRP1_MASK                       ((unsigned int) 0x000000FF)

/*  STARTERP1 (Start logic signal enable register 1)
    This STARTERP1 register enables or disables the start signal bits in the start logic. */

#define SCB_STARTERP1_ERPIO2_8                    ((unsigned int) 0x00000001)
#define SCB_STARTERP1_ERPIO2_8_MASK               ((unsigned int) 0x00000001)
#define SCB_STARTERP1_ERPIO2_8                    ((unsigned int) 0x00000001)
#define SCB_STARTERP1_ERPIO2_9_MASK               ((unsigned int) 0x00000002)
#define SCB_STARTERP1_ERPIO2_10                   ((unsigned int) 0x00000004)
#define SCB_STARTERP1_ERPIO2_10_MASK              ((unsigned int) 0x00000004)
#define SCB_STARTERP1_ERPIO2_11                   ((unsigned int) 0x00000008)
#define SCB_STARTERP1_ERPIO2_11_MASK              ((unsigned int) 0x00000008)
#define SCB_STARTERP1_ERPIO3_0                    ((unsigned int) 0x00000010)
#define SCB_STARTERP1_ERPIO3_0_MASK               ((unsigned int) 0x00000010)
#define SCB_STARTERP1_ERPIO3_1                    ((unsigned int) 0x00000020)
#define SCB_STARTERP1_ERPIO3_1_MASK               ((unsigned int) 0x00000020)
#define SCB_STARTERP1_ERPIO3_2                    ((unsigned int) 0x00000040)
#define SCB_STARTERP1_ERPIO3_2_MASK               ((unsigned int) 0x00000040)
#define SCB_STARTERP1_ERPIO3_3                    ((unsigned int) 0x00000080)
#define SCB_STARTERP1_ERPIO3_3_MASK               ((unsigned int) 0x00000080)
#define SCB_STARTERP1_MASK                        ((unsigned int) 0x000000FF)

/*  (Start logic reset register 1)
    Writing a one to a bit in the STARTRSRP1CLR register resets the start logic state. The
    start-up logic uses the input signals to generate a clock edge for registering a start
    signal. This clock edge (falling or rising) sets the interrupt for waking up from
    Deep-sleep mode. Therefore, the start-up logic states must be cleared before being used. */

#define SCB_STARTRSRP1CLR_RSRPIO2_8               ((unsigned int) 0x00000001)
#define SCB_STARTRSRP1CLR_RSRPIO2_8_MASK          ((unsigned int) 0x00000001)
#define SCB_STARTRSRP1CLR_RSRPIO2_8               ((unsigned int) 0x00000001)
#define SCB_STARTRSRP1CLR_RSRPIO2_9_MASK          ((unsigned int) 0x00000002)
#define SCB_STARTRSRP1CLR_RSRPIO2_10              ((unsigned int) 0x00000004)
#define SCB_STARTRSRP1CLR_RSRPIO2_10_MASK         ((unsigned int) 0x00000004)
#define SCB_STARTRSRP1CLR_RSRPIO2_11              ((unsigned int) 0x00000008)
#define SCB_STARTRSRP1CLR_RSRPIO2_11_MASK         ((unsigned int) 0x00000008)
#define SCB_STARTRSRP1CLR_RSRPIO3_0               ((unsigned int) 0x00000010)
#define SCB_STARTRSRP1CLR_RSRPIO3_0_MASK          ((unsigned int) 0x00000010)
#define SCB_STARTRSRP1CLR_RSRPIO3_1               ((unsigned int) 0x00000020)
#define SCB_STARTRSRP1CLR_RSRPIO3_1_MASK          ((unsigned int) 0x00000020)
#define SCB_STARTRSRP1CLR_RSRPIO3_2               ((unsigned int) 0x00000040)
#define SCB_STARTRSRP1CLR_RSRPIO3_2_MASK          ((unsigned int) 0x00000040)
#define SCB_STARTRSRP1CLR_RSRPIO3_3               ((unsigned int) 0x00000080)
#define SCB_STARTRSRP1CLR_RSRPIO3_3_MASK          ((unsigned int) 0x00000080)
#define SCB_STARTRSRP1CLR_MASK                    ((unsigned int) 0x000000FF)

/*  STARTSRP1 (Start logic status register 1)
    This register reflects the status of the enabled start signals. */

#define SCB_STARTSRP1_SRPIO2_8                    ((unsigned int) 0x00000001)
#define SCB_STARTSRP1_SRPIO2_8_MASK               ((unsigned int) 0x00000001)
#define SCB_STARTSRP1_SRPIO2_8                    ((unsigned int) 0x00000001)
#define SCB_STARTSRP1_SRPIO2_9_MASK               ((unsigned int) 0x00000002)
#define SCB_STARTSRP1_SRPIO2_10                   ((unsigned int) 0x00000004)
#define SCB_STARTSRP1_SRPIO2_10_MASK              ((unsigned int) 0x00000004)
#define SCB_STARTSRP1_SRPIO2_11                   ((unsigned int) 0x00000008)
#define SCB_STARTSRP1_SRPIO2_11_MASK              ((unsigned int) 0x00000008)
#define SCB_STARTSRP1_SRPIO3_0                    ((unsigned int) 0x00000010)
#define SCB_STARTSRP1_SRPIO3_0_MASK               ((unsigned int) 0x00000010)
#define SCB_STARTSRP1_SRPIO3_1                    ((unsigned int) 0x00000020)
#define SCB_STARTSRP1_SRPIO3_1_MASK               ((unsigned int) 0x00000020)
#define SCB_STARTSRP1_SRPIO3_2                    ((unsigned int) 0x00000040)
#define SCB_STARTSRP1_SRPIO3_2_MASK               ((unsigned int) 0x00000040)
#define SCB_STARTSRP1_SRPIO3_3                    ((unsigned int) 0x00000080)
#define SCB_STARTSRP1_SRPIO3_3_MASK               ((unsigned int) 0x00000080)
#define SCB_STARTSRP1_MASK                        ((unsigned int) 0x000000FF)

