r0ket/r0ket/firmware/core/lpc134x.h
/*  PDSLEEPCFG (Deep-sleep mode configuration register)
    The bits in this register can be programmed to indicate the state the chip must enter when
    the Deep-sleep mode is asserted by the ARM. The value of the PDSLEEPCFG register
    will be automatically loaded into the PDRUNCFG register when the Sleep mode is
    entered. */

#define SCB_PDSLEEPCFG_IRCOUT_PD                  ((unsigned int) 0x00000001)
#define SCB_PDSLEEPCFG_IRCOUT_PD_MASK             ((unsigned int) 0x00000001)
#define SCB_PDSLEEPCFG_IRC_PD                     ((unsigned int) 0x00000002)
#define SCB_PDSLEEPCFG_IRC_PD_MASK                ((unsigned int) 0x00000002)
#define SCB_PDSLEEPCFG_FLASH_PD                   ((unsigned int) 0x00000004)
#define SCB_PDSLEEPCFG_FLASH_PD_MASK              ((unsigned int) 0x00000004)
#define SCB_PDSLEEPCFG_BOD_PD                     ((unsigned int) 0x00000008)
#define SCB_PDSLEEPCFG_BOD_PD_MASK                ((unsigned int) 0x00000008)
#define SCB_PDSLEEPCFG_ADC_PD                     ((unsigned int) 0x00000010)
#define SCB_PDSLEEPCFG_ADC_PD_MASK                ((unsigned int) 0x00000010)
#define SCB_PDSLEEPCFG_SYSOSC_PD                  ((unsigned int) 0x00000020)
#define SCB_PDSLEEPCFG_SYSOSC_PD_MASK             ((unsigned int) 0x00000020)
#define SCB_PDSLEEPCFG_WDTOSC_PD                  ((unsigned int) 0x00000040)
#define SCB_PDSLEEPCFG_WDTOSC_PD_MASK             ((unsigned int) 0x00000040)
#define SCB_PDSLEEPCFG_SYSPLL_PD                  ((unsigned int) 0x00000080)
#define SCB_PDSLEEPCFG_SYSPLL_PD_MASK             ((unsigned int) 0x00000080)
#define SCB_PDSLEEPCFG_USBPLL_PD                  ((unsigned int) 0x00000100)
#define SCB_PDSLEEPCFG_USBPLL_PD_MASK             ((unsigned int) 0x00000100)
#define SCB_PDSLEEPCFG_USBPAD_PD                  ((unsigned int) 0x00000400)
#define SCB_PDSLEEPCFG_USBPAD_PD_MASK             ((unsigned int) 0x00000400)

/*  PDAWAKECFG (Wake-up configuration register)
    The bits in this register can be programmed to indicate the state the chip must enter when
    it is waking up from Deep-sleep mode. */

#define SCB_PDAWAKECFG_IRCOUT_PD                  ((unsigned int) 0x00000001)
#define SCB_PDAWAKECFG_IRCOUT_PD_MASK             ((unsigned int) 0x00000001)
#define SCB_PDAWAKECFG_IRC_PD                     ((unsigned int) 0x00000002)
#define SCB_PDAWAKECFG_IRC_PD_MASK                ((unsigned int) 0x00000002)
#define SCB_PDAWAKECFG_FLASH_PD                   ((unsigned int) 0x00000004)
#define SCB_PDAWAKECFG_FLASH_PD_MASK              ((unsigned int) 0x00000004)
#define SCB_PDAWAKECFG_BOD_PD                     ((unsigned int) 0x00000008)
#define SCB_PDAWAKECFG_BOD_PD_MASK                ((unsigned int) 0x00000008)
#define SCB_PDAWAKECFG_ADC_PD                     ((unsigned int) 0x00000010)
#define SCB_PDAWAKECFG_ADC_PD_MASK                ((unsigned int) 0x00000010)
#define SCB_PDAWAKECFG_SYSOSC_PD                  ((unsigned int) 0x00000020)
#define SCB_PDAWAKECFG_SYSOSC_PD_MASK             ((unsigned int) 0x00000020)
#define SCB_PDAWAKECFG_WDTOSC_PD                  ((unsigned int) 0x00000040)
#define SCB_PDAWAKECFG_WDTOSC_PD_MASK             ((unsigned int) 0x00000040)
#define SCB_PDAWAKECFG_SYSPLL_PD                  ((unsigned int) 0x00000080)
#define SCB_PDAWAKECFG_SYSPLL_PD_MASK             ((unsigned int) 0x00000080)
#define SCB_PDAWAKECFG_USBPLL_PD                  ((unsigned int) 0x00000100)
#define SCB_PDAWAKECFG_USBPLL_PD_MASK             ((unsigned int) 0x00000100)
#define SCB_PDAWAKECFG_USBPAD_PD                  ((unsigned int) 0x00000400)
#define SCB_PDAWAKECFG_USBPAD_PD_MASK             ((unsigned int) 0x00000400)

/*  PDRUNCFG (Power-down configuration register)
    The bits in the PDRUNCFG register control the power to the various analog blocks. This
    register can be written to at any time while the chip is running, and a write will take effect
    immediately with the exception of the power-down signal to the IRC.  Setting a 1 powers-down
    a peripheral and 0 enables it. */

#define SCB_PDRUNCFG_IRCOUT                       ((unsigned int) 0x00000001) // IRC oscillator output power-down
#define SCB_PDRUNCFG_IRCOUT_MASK                  ((unsigned int) 0x00000001)    
#define SCB_PDRUNCFG_IRC                          ((unsigned int) 0x00000002) // IRC oscillator power-down
#define SCB_PDRUNCFG_IRC_MASK                     ((unsigned int) 0x00000002)
#define SCB_PDRUNCFG_FLASH                        ((unsigned int) 0x00000004) // Flash power-down
#define SCB_PDRUNCFG_FLASH_MASK                   ((unsigned int) 0x00000004)
#define SCB_PDRUNCFG_BOD                          ((unsigned int) 0x00000008) // Brown-out detector power-down
#define SCB_PDRUNCFG_BOD_MASK                     ((unsigned int) 0x00000008)
#define SCB_PDRUNCFG_ADC                          ((unsigned int) 0x00000010) // ADC power-down
#define SCB_PDRUNCFG_ADC_MASK                     ((unsigned int) 0x00000010)
#define SCB_PDRUNCFG_SYSOSC                       ((unsigned int) 0x00000020) // System oscillator power-down
#define SCB_PDRUNCFG_SYSOSC_MASK                  ((unsigned int) 0x00000020)
#define SCB_PDRUNCFG_WDTOSC                       ((unsigned int) 0x00000040) // Watchdog oscillator power-down
#define SCB_PDRUNCFG_WDTOSC_MASK                  ((unsigned int) 0x00000040)
#define SCB_PDRUNCFG_SYSPLL                       ((unsigned int) 0x00000080) // System PLL power-down
#define SCB_PDRUNCFG_SYSPLL_MASK                  ((unsigned int) 0x00000080)
#define SCB_PDRUNCFG_USBPLL                       ((unsigned int) 0x00000100) // USB PLL power-down
#define SCB_PDRUNCFG_USBPLL_MASK                  ((unsigned int) 0x00000100)
#define SCB_PDRUNCFG_USBPAD                       ((unsigned int) 0x00000400) // USB PHY power-down
#define SCB_PDRUNCFG_USBPAD_MASK                  ((unsigned int) 0x00000400)

/*  DEVICE_ID (Device ID Register)
    This device ID register is a read-only register and contains the device ID for each
    LPC13xx part. This register is also read by the ISP/IAP commands. */

#define SCB_DEVICEID_LPC1311FHN33                 ((unsigned int) 0x2C42502B)
#define SCB_DEVICEID_LPC1313FHN33                 ((unsigned int) 0x2C40102B)
#define SCB_DEVICEID_LPC1313FBD48                 ((unsigned int) 0x2C40102B)
#define SCB_DEVICEID_LPC1342FHN33                 ((unsigned int) 0x3D01402B)
#define SCB_DEVICEID_LPC1343FHN33                 ((unsigned int) 0x3D00002B)
#define SCB_DEVICEID_LPC1343FBD48                 ((unsigned int) 0x3D00002B)

