r0ket/r0ket/firmware/core/lpc134x.h
/*##############################################################################
## GPIO - General Purpose I/O
##############################################################################*/

#define GPIO_GPIO0_BASE                           (0x50000000)
#define GPIO_GPIO1_BASE                           (0x50010000)
#define GPIO_GPIO2_BASE                           (0x50020000)
#define GPIO_GPIO3_BASE                           (0x50030000)

#define GPIO_GPIO0DATA                            (*(pREG32 (0x50003FFC)))    // Port data register
#define GPIO_GPIO0DIR                             (*(pREG32 (0x50008000)))    // Data direction register
#define GPIO_GPIO0IS                              (*(pREG32 (0x50008004)))    // Interrupt sense register
#define GPIO_GPIO0IBE                             (*(pREG32 (0x50008008)))    // Interrupt both edges register
#define GPIO_GPIO0IEV                             (*(pREG32 (0x5000800C)))    // Interrupt event register
#define GPIO_GPIO0IE                              (*(pREG32 (0x50008010)))    // Interrupt mask register
#define GPIO_GPIO0RIS                             (*(pREG32 (0x50008014)))    // Raw interrupt status register
#define GPIO_GPIO0MIS                             (*(pREG32 (0x50008018)))    // Masked interrupt status register
#define GPIO_GPIO0IC                              (*(pREG32 (0x5000801C)))    // Interrupt clear register

#define GPIO_GPIO1DATA                            (*(pREG32 (0x50013FFC)))    // Port data register
#define GPIO_GPIO1DIR                             (*(pREG32 (0x50018000)))    // Data direction register
#define GPIO_GPIO1IS                              (*(pREG32 (0x50018004)))    // Interrupt sense register
#define GPIO_GPIO1IBE                             (*(pREG32 (0x50018008)))    // Interrupt both edges register
#define GPIO_GPIO1IEV                             (*(pREG32 (0x5001800C)))    // Interrupt event register
#define GPIO_GPIO1IE                              (*(pREG32 (0x50018010)))    // Interrupt mask register
#define GPIO_GPIO1RIS                             (*(pREG32 (0x50018014)))    // Raw interrupt status register
#define GPIO_GPIO1MIS                             (*(pREG32 (0x50018018)))    // Masked interrupt status register
#define GPIO_GPIO1IC                              (*(pREG32 (0x5001801C)))    // Interrupt clear register

#define GPIO_GPIO2DATA                            (*(pREG32 (0x50023FFC)))    // Port data register
#define GPIO_GPIO2DIR                             (*(pREG32 (0x50028000)))    // Data direction register
#define GPIO_GPIO2IS                              (*(pREG32 (0x50028004)))    // Interrupt sense register
#define GPIO_GPIO2IBE                             (*(pREG32 (0x50028008)))    // Interrupt both edges register
#define GPIO_GPIO2IEV                             (*(pREG32 (0x5002800C)))    // Interrupt event register
#define GPIO_GPIO2IE                              (*(pREG32 (0x50028010)))    // Interrupt mask register
#define GPIO_GPIO2RIS                             (*(pREG32 (0x50028014)))    // Raw interrupt status register
#define GPIO_GPIO2MIS                             (*(pREG32 (0x50028018)))    // Masked interrupt status register
#define GPIO_GPIO2IC                              (*(pREG32 (0x5002801C)))    // Interrupt clear register

#define GPIO_GPIO3DATA                            (*(pREG32 (0x50033FFC)))    // Port data register
#define GPIO_GPIO3DIR                             (*(pREG32 (0x50038000)))    // Data direction register
#define GPIO_GPIO3IS                              (*(pREG32 (0x50038004)))    // Interrupt sense register
#define GPIO_GPIO3IBE                             (*(pREG32 (0x50038008)))    // Interrupt both edges register
#define GPIO_GPIO3IEV                             (*(pREG32 (0x5003800C)))    // Interrupt event register
#define GPIO_GPIO3IE                              (*(pREG32 (0x50038010)))    // Interrupt mask register
#define GPIO_GPIO3RIS                             (*(pREG32 (0x50038014)))    // Raw interrupt status register
#define GPIO_GPIO3MIS                             (*(pREG32 (0x50038018)))    // Masked interrupt status register
#define GPIO_GPIO3IC                              (*(pREG32 (0x5003801C)))    // Interrupt clear register

#define GPIO_IO_P0                                ((unsigned int) 0x00000001)
#define GPIO_IO_P1                                ((unsigned int) 0x00000002)
#define GPIO_IO_P2                                ((unsigned int) 0x00000004)
#define GPIO_IO_P3                                ((unsigned int) 0x00000008)
#define GPIO_IO_P4                                ((unsigned int) 0x00000010)
#define GPIO_IO_P5                                ((unsigned int) 0x00000020)
#define GPIO_IO_P6                                ((unsigned int) 0x00000040)
#define GPIO_IO_P7                                ((unsigned int) 0x00000080)
#define GPIO_IO_P8                                ((unsigned int) 0x00000100)
#define GPIO_IO_P9                                ((unsigned int) 0x00000200)
#define GPIO_IO_P10                               ((unsigned int) 0x00000400)
#define GPIO_IO_P11                               ((unsigned int) 0x00000800)
#define GPIO_IO_ALL                               ((unsigned int) 0x00000FFF)

/*##############################################################################
## USB
##############################################################################*/

/* USB registers are defined in USB code */
#define USB_BASE_ADDRESS                          (0x40020000)

/* USB Device Interrupt Status Register */
#define USB_DEVINTST                              (*(pREG32 (0x40020000)))
#define USB_DEVINTST_FRAME_MASK                   ((unsigned int) 0x00000001) 
#define USB_DEVINTST_FRAME                        ((unsigned int) 0x00000001) // Frame interrupt
#define USB_DEVINTST_EP0_MASK                     ((unsigned int) 0x00000002) 
#define USB_DEVINTST_EP0                          ((unsigned int) 0x00000002) // USB core interrupt for EP0
#define USB_DEVINTST_EP1_MASK                     ((unsigned int) 0x00000004) 
#define USB_DEVINTST_EP1                          ((unsigned int) 0x00000004) // USB core interrupt for EP1
#define USB_DEVINTST_EP2_MASK                     ((unsigned int) 0x00000008) 
#define USB_DEVINTST_EP2                          ((unsigned int) 0x00000008) // USB core interrupt for EP2
#define USB_DEVINTST_EP3_MASK                     ((unsigned int) 0x00000010)
#define USB_DEVINTST_EP3                          ((unsigned int) 0x00000010) // USB core interrupt for EP3
#define USB_DEVINTST_EP4_MASK                     ((unsigned int) 0x00000020)
#define USB_DEVINTST_EP4                          ((unsigned int) 0x00000020) // USB core interrupt for EP4
#define USB_DEVINTST_EP5_MASK                     ((unsigned int) 0x00000040)
#define USB_DEVINTST_EP5                          ((unsigned int) 0x00000040) // USB core interrupt for EP5
#define USB_DEVINTST_EP6_MASK                     ((unsigned int) 0x00000080)
#define USB_DEVINTST_EP6                          ((unsigned int) 0x00000080) // USB core interrupt for EP6
#define USB_DEVINTST_EP7_MASK                     ((unsigned int) 0x00000100)
#define USB_DEVINTST_EP7                          ((unsigned int) 0x00000100) // USB core interrupt for EP7
#define USB_DEVINTST_DEV_START_MASK               ((unsigned int) 0x00000200)
#define USB_DEVINTST_DEV_START                    ((unsigned int) 0x00000200)
#define USB_DEVINTST_CC_EMPTY_MASK                ((unsigned int) 0x00000400)
#define USB_DEVINTST_CC_EMPTY                     ((unsigned int) 0x00000400)
#define USB_DEVINTST_CD_FULL_MASK                 ((unsigned int) 0x00000800)
#define USB_DEVINTST_CD_FULL                      ((unsigned int) 0x00000800)
#define USB_DEVINTST_RxENDPKT_MASK                ((unsigned int) 0x00001000)
#define USB_DEVINTST_RxENDPKT                     ((unsigned int) 0x00001000)
#define USB_DEVINTST_TxENDPKT_MASK                ((unsigned int) 0x00002000)
#define USB_DEVINTST_TxENDPKT                     ((unsigned int) 0x00002000)

/* USB Device Interrupt Enable Register  */
#define USB_DEVINTEN                              (*(pREG32 (0x40020004)))
#define USB_DEVINTEN_FRAME_MASK                   ((unsigned int) 0x00000001)
#define USB_DEVINTEN_FRAME                        ((unsigned int) 0x00000001)
#define USB_DEVINTEN_EP0_MASK                     ((unsigned int) 0x00000002)
#define USB_DEVINTEN_EP0                          ((unsigned int) 0x00000002)
#define USB_DEVINTEN_EP1_MASK                     ((unsigned int) 0x00000004)
#define USB_DEVINTEN_EP1                          ((unsigned int) 0x00000004)
#define USB_DEVINTEN_EP2_MASK                     ((unsigned int) 0x00000008)
#define USB_DEVINTEN_EP2                          ((unsigned int) 0x00000008)
#define USB_DEVINTEN_EP3_MASK                     ((unsigned int) 0x00000010)
#define USB_DEVINTEN_EP3                          ((unsigned int) 0x00000010)
#define USB_DEVINTEN_EP4_MASK                     ((unsigned int) 0x00000020)
#define USB_DEVINTEN_EP4                          ((unsigned int) 0x00000020)
#define USB_DEVINTEN_EP5_MASK                     ((unsigned int) 0x00000040)
#define USB_DEVINTEN_EP5                          ((unsigned int) 0x00000040)
#define USB_DEVINTEN_EP6_MASK                     ((unsigned int) 0x00000080)
#define USB_DEVINTEN_EP6                          ((unsigned int) 0x00000080)
#define USB_DEVINTEN_EP7_MASK                     ((unsigned int) 0x00000100)
#define USB_DEVINTEN_EP7                          ((unsigned int) 0x00000100)
#define USB_DEVINTEN_DEV_START_MASK               ((unsigned int) 0x00000200)
#define USB_DEVINTEN_DEV_START                    ((unsigned int) 0x00000200)
#define USB_DEVINTEN_CC_EMPTY_MASK                ((unsigned int) 0x00000400)
#define USB_DEVINTEN_CC_EMPTY                     ((unsigned int) 0x00000400)
#define USB_DEVINTEN_CD_FULL_MASK                 ((unsigned int) 0x00000800)
#define USB_DEVINTEN_CD_FULL                      ((unsigned int) 0x00000800)
#define USB_DEVINTEN_RxENDPKT_MASK                ((unsigned int) 0x00001000)
#define USB_DEVINTEN_RxENDPKT                     ((unsigned int) 0x00001000)
#define USB_DEVINTEN_TxENDPKT_MASK                ((unsigned int) 0x00002000)
#define USB_DEVINTEN_TxENDPKT                     ((unsigned int) 0x00002000)

/* USB Device Interrupt Clear Register  */
#define USB_DEVINTCLR                             (*(pREG32 (0x40020008)))
#define USB_DEVINTCLR_FRAME_MASK                  ((unsigned int) 0x00000001)
#define USB_DEVINTCLR_FRAME                       ((unsigned int) 0x00000001)
#define USB_DEVINTCLR_EP0_MASK                    ((unsigned int) 0x00000002)
#define USB_DEVINTCLR_EP0                         ((unsigned int) 0x00000002)
#define USB_DEVINTCLR_EP1_MASK                    ((unsigned int) 0x00000004)
#define USB_DEVINTCLR_EP1                         ((unsigned int) 0x00000004)
#define USB_DEVINTCLR_EP2_MASK                    ((unsigned int) 0x00000008)
#define USB_DEVINTCLR_EP2                         ((unsigned int) 0x00000008)
#define USB_DEVINTCLR_EP3_MASK                    ((unsigned int) 0x00000010)
#define USB_DEVINTCLR_EP3                         ((unsigned int) 0x00000010)
#define USB_DEVINTCLR_EP4_MASK                    ((unsigned int) 0x00000020)
#define USB_DEVINTCLR_EP4                         ((unsigned int) 0x00000020)
#define USB_DEVINTCLR_EP5_MASK                    ((unsigned int) 0x00000040)
#define USB_DEVINTCLR_EP5                         ((unsigned int) 0x00000040)
#define USB_DEVINTCLR_EP6_MASK                    ((unsigned int) 0x00000080)
#define USB_DEVINTCLR_EP6                         ((unsigned int) 0x00000080)
#define USB_DEVINTCLR_EP7_MASK                    ((unsigned int) 0x00000100)
#define USB_DEVINTCLR_EP7                         ((unsigned int) 0x00000100)
#define USB_DEVINTCLR_DEV_START_MASK              ((unsigned int) 0x00000200)
#define USB_DEVINTCLR_DEV_START                   ((unsigned int) 0x00000200)
#define USB_DEVINTCLR_CC_EMPTY_MASK               ((unsigned int) 0x00000400)
#define USB_DEVINTCLR_CC_EMPTY                    ((unsigned int) 0x00000400)
#define USB_DEVINTCLR_CD_FULL_MASK                ((unsigned int) 0x00000800)
#define USB_DEVINTCLR_CD_FULL                     ((unsigned int) 0x00000800)
#define USB_DEVINTCLR_RxENDPKT_MASK               ((unsigned int) 0x00001000)
#define USB_DEVINTCLR_RxENDPKT                    ((unsigned int) 0x00001000)
#define USB_DEVINTCLR_TxENDPKT_MASK               ((unsigned int) 0x00002000)
#define USB_DEVINTCLR_TxENDPKT                    ((unsigned int) 0x00002000)

