r0ket/r0ket/firmware/core/lpc134x.h
/* USB Device Interrupt Set Register  */
#define USB_DEVINTSET                             (*(pREG32 (0x4002000C)))
#define USB_DEVINTSET_FRAME_MASK                  ((unsigned int) 0x00000001)
#define USB_DEVINTSET_FRAME                       ((unsigned int) 0x00000001)
#define USB_DEVINTSET_EP0_MASK                    ((unsigned int) 0x00000002)
#define USB_DEVINTSET_EP0                         ((unsigned int) 0x00000002)
#define USB_DEVINTSET_EP1_MASK                    ((unsigned int) 0x00000004)
#define USB_DEVINTSET_EP1                         ((unsigned int) 0x00000004)
#define USB_DEVINTSET_EP2_MASK                    ((unsigned int) 0x00000008)
#define USB_DEVINTSET_EP2                         ((unsigned int) 0x00000008)
#define USB_DEVINTSET_EP3_MASK                    ((unsigned int) 0x00000010)
#define USB_DEVINTSET_EP3                         ((unsigned int) 0x00000010)
#define USB_DEVINTSET_EP4_MASK                    ((unsigned int) 0x00000020)
#define USB_DEVINTSET_EP4                         ((unsigned int) 0x00000020)
#define USB_DEVINTSET_EP5_MASK                    ((unsigned int) 0x00000040)
#define USB_DEVINTSET_EP5                         ((unsigned int) 0x00000040)
#define USB_DEVINTSET_EP6_MASK                    ((unsigned int) 0x00000080)
#define USB_DEVINTSET_EP6                         ((unsigned int) 0x00000080)
#define USB_DEVINTSET_EP7_MASK                    ((unsigned int) 0x00000100)
#define USB_DEVINTSET_EP7                         ((unsigned int) 0x00000100)
#define USB_DEVINTSET_DEV_START_MASK              ((unsigned int) 0x00000200)
#define USB_DEVINTSET_DEV_START                   ((unsigned int) 0x00000200)
#define USB_DEVINTSET_CC_EMPTY_MASK               ((unsigned int) 0x00000400)
#define USB_DEVINTSET_CC_EMPTY                    ((unsigned int) 0x00000400)
#define USB_DEVINTSET_CD_FULL_MASK                ((unsigned int) 0x00000800)
#define USB_DEVINTSET_CD_FULL                     ((unsigned int) 0x00000800)
#define USB_DEVINTSET_RxENDPKT_MASK               ((unsigned int) 0x00001000)
#define USB_DEVINTSET_RxENDPKT                    ((unsigned int) 0x00001000)
#define USB_DEVINTSET_TxENDPKT_MASK               ((unsigned int) 0x00002000)
#define USB_DEVINTSET_TxENDPKT                    ((unsigned int) 0x00002000)

/* USB Command Code Register */
#define USB_CMDCODE                               (*(pREG32 (0x40020010)))
#define USB_CMDCODE_CMD_PHASE_WRITE               ((unsigned int) 0x00000100)
#define USB_CMDCODE_CMD_PHASE_READ                ((unsigned int) 0x00000200)
#define USB_CMDCODE_CMD_PHASE_COMMAND             ((unsigned int) 0x00000500)
#define USB_CMDCODE_CMD_PHASE_MASK                ((unsigned int) 0x0000FF00)
#define USB_CMDCODE_CMD_CODE_MASK                 ((unsigned int) 0x00FF0000)
#define USB_CMDCODE_CMD_WDATA_MASK                ((unsigned int) 0x00FF0000)

/* USB Command Data Register */
#define USB_CMDDATA                               (*(pREG32 (0x40020014)))
#define USB_CMDDATA_CMD_RDATA_MASK                ((unsigned int) 0x000000FF)

/* USB Receive Data Register */
#define USB_RXDATA                                (*(pREG32 (0x40020018)))

/* USB Transmit Data Register */
#define USB_TXDATA                                (*(pREG32 (0x4002001C)))

/* USB Receive Packet Length Register */
#define USB_RXPLEN                                (*(pREG32 (0x40020020)))
#define USB_RXPLEN_PKT_LNGTH_MASK                 ((unsigned int) 0x000003FF)
#define USB_RXPLEN_DV_MASK                        ((unsigned int) 0x00000400)
#define USB_RXPLEN_DV                             ((unsigned int) 0x00000400)

/* USB Transmit Packet Length Register */
#define USB_TXPLEN                                (*(pREG32 (0x40020024)))
#define USB_TXPLEN_PKT_LNGTH_MASK 0x3FF

/* USB Control Register */
#define USB_CTRL                                  (*(pREG32 (0x40020028)))
#define USB_CTRL_RD_EN_MASK                       ((unsigned int) 0x00000001)
#define USB_CTRL_RD_EN                            ((unsigned int) 0x00000001)
#define USB_CTRL_WR_EN_MASK                       ((unsigned int) 0x00000002)
#define USB_CTRL_WR_EN                            ((unsigned int) 0x00000002)
#define USB_CTRL_LOG_ENDPOINT_MASK                ((unsigned int) 0x0000003C)

/* USB Device FIQ Select Register */
#define USB_DEVFIQSEL                             (*(pREG32 (0x4002002C)))
#define USB_DEVFIQSEL_FRAME_MASK                  ((unsigned int) 0x00000001)
#define USB_DEVFIQSEL_FRAME                       ((unsigned int) 0x00000001)
#define USB_DEVFIQSEL_BULKOUT_MASK                ((unsigned int) 0x00000002)
#define USB_DEVFIQSEL_BULKOUT                     ((unsigned int) 0x00000002)
#define USB_DEVFIQSEL_BULKIN_MASK                 ((unsigned int) 0x00000004)
#define USB_DEVFIQSEL_BULKIN                      ((unsigned int) 0x00000004)

/*##############################################################################
## UART
##############################################################################*/

#define UART_BASE_ADDRESS                         (0x40008000)

#define UART_U0RBR                                (*(pREG32 (0x40008000)))    // Receive buffer
#define UART_U0THR                                (*(pREG32 (0x40008000)))    // Transmitter holding register
#define UART_U0DLL                                (*(pREG32 (0x40008000)))    // Divisor latch LSB
#define UART_U0DLM                                (*(pREG32 (0x40008004)))    // Divisor latch MSB
#define UART_U0IER                                (*(pREG32 (0x40008004)))    // Interrupt enable
#define UART_U0IIR                                (*(pREG32 (0x40008008)))    // Interrupt identification
#define UART_U0FCR                                (*(pREG32 (0x40008008)))    // FIFO control
#define UART_U0MCR                                (*(pREG32 (0x40008010)))    // Modem control
#define UART_U0LCR                                (*(pREG32 (0x4000800C)))    // Line control
#define UART_U0LSR                                (*(pREG32 (0x40008014)))    // Line status
#define UART_U0MSR                                (*(pREG32 (0x40008018)))    // Modem status
#define UART_U0SCR                                (*(pREG32 (0x4000801C)))    // Scratch pad
#define UART_U0ACR                                (*(pREG32 (0x40008020)))    // Auto-baud control
#define UART_U0FDR                                (*(pREG32 (0x40008028)))    // Fractional divider
#define UART_U0TER                                (*(pREG32 (0x40008030)))    // Transmit enable
#define UART_U0RS485CTRL                          (*(pREG32 (0x4000804C)))    // RS485 control register
#define UART_U0RS485ADRMATCH                      (*(pREG32 (0x40008050)))    // RS485 address match
#define UART_U0RS485DLY                           (*(pREG32 (0x40008054)))    // RS485 Delay value
#define UART_U0FIFOLVL                            (*(pREG32 (0x40008058)))    // UART FIFO level

