r0ket/r0ket/firmware/core/lpc134x.h
/*##############################################################################
## Misc. Inline Functions
##############################################################################*/

/**************************************************************************/
/*! 
    @brief  Reverses the bit order of a 32-bit value

    Allows single-cycle reversing of 32-bit values (ASM RBIT)

    @param[in]  value  
                The 32-bit value to reverse
    @returns    The reversed value
*/
/**************************************************************************/
static inline uint32_t RBIT(uint32_t value)     { uint32_t result=0; __asm volatile ("rbit %0, %1" : "=r" (result) : "r" (value) ); return(result); }

/**************************************************************************/
/*! 
    @brief  Causes a system reset and enters the USB Bootloader

    Resets the system using the AIRCR register, and waits in a loop until
    reset occurs.  The resistor/divider on the LPC1343 Reference Design
    Base Board [1] causes the AIRCR reset to enter the bootloader rather
    than executing the existing firmware.  If you wish to reset and execute
    the existing firmware, you need to use the watchdog timer to reset
    (see "wdt/wdt.c").

    [1] http://www.microbuilder.eu/Projects/LPC1343ReferenceDesign.aspx
*/
/**************************************************************************/
static inline void __resetBootloader()          { __disable_irq(); SCB_AIRCR = SCB_AIRCR_VECTKEY_VALUE | SCB_AIRCR_SYSRESETREQ; while(1); }

#endif
